/*********************************************************************************************
程序名： 　　 io口 4种工作模式 - 测试强推挽，高阻，开漏模式
编写人： 　　 　
编写时间：　　
硬件支持：　　STC12C5616AD  12MHz晶振
接口说明：　　P14接led正极，P16接led负极，观察到亮度很亮
举例：
MOV P1M0, #10100000B
MOV P1M1, #11010000B 

P1.7 开漏
P1.6/P1.4 强推挽，强上拉
P1.5 高阻，仅输入
P1.3/P1.2/P1.1/P1.0 准双向，弱上拉

/*********************************************************************************************/


//#include <REG51.h> //通用89C51头文件
#include <STC12C5620AD.H> // STC12C5616AD 凑合用
//#include <STC12C5A60S2.H> // STC12C5A60S2 系列单片机头文件


sbit P13 = P1^3;
sbit P14 = P1^4;
sbit P15 = P1^5;
sbit P16 = P1^6;
sbit P17 = P1^7;



/*********************************************************************************************
函数名：主函数
调  用：无
参  数：无
返回值：无
结  果：程序开始处，无限循环
备  注：
/**********************************************************************************************/
void main (void){
	P1M0 = 0xA0; //MOV P1M0, #10100000B
	P1M1 = 0xD0; //MOV P1M1, #11010000B 

	
	P14 = 1;
	P16 = 0;
	while(1){
		
	}
}


















