#include <STC12C5620AD.H> //STC12C5620AD
//#include <REG51.h> //通用89C51头文件


sbit LED = P1 ^ 7; //定义1.7脚为 LED
sbit LED2 = P1 ^ 6;
sbit LED3 = P1 ^ 4;

/*********************************************************************************************
函数名：毫秒级CPU延时函数
调  用：DELAY_MS (?);
参  数：1~65535（参数不可为0）
返回值：无
结  果：占用CPU方式延时与参数数值相同的毫秒时间
备  注：应用于1T单片机时i<600，应用于12T单片机时i<125
/*********************************************************************************************/
void DELAY_MS (unsigned int a){
	unsigned int i;
	while( --a != 0){
		for(i = 0; i < 600; i++);
	}
}
/*********************************************************************************************/


void main (void){
	while(1){
		LED = ~LED; //LED所在引脚电压取反
		DELAY_MS(1000); //sleep 1s
		LED2 = ~LED2; //LED所在引脚电压取反
		DELAY_MS(1000); //sleep 1s
		LED3 = ~LED3; //LED所在引脚电压取反
		DELAY_MS(1000); //sleep 1s
	}
}

